zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/beacon/coord/app_security.c
/**
 * @file app_security.c
 *
 * @brief MAC Example Beacon Security Application - Coordinator
 *
 * Copyright (c) 2013 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 */

/**
 * \mainpage
 * \section preface Preface
 * This is the reference manual for the IEEE 802.15.4 MAC Beacon Security Application -
 *Coordinator
 * \section main_files Application Files
 *      - app_security.c                Application security file.
 * \section intro Application Introduction
 * The basic MAC Example Beacon Application deploys a beacon-enabled network
 *with star topology.
 * The coordinator starts a PAN at channel DEFAULT_CHANNEL with the PAN ID
 *DEFAULT_PAN_ID.
 *
 * The coordinator starts a beaconing network and transmits user data within
 *beacon payload of transmitted beacon frames.
 * The device scans for this network,sync up with the coordinator and associates
 *to the coordinator.The devices receive
 * these beacon frames, extract the received user data from the coordinator
 *,print the received data on the hyper
 * terminal and also sends the extracted beacon payload back to the coordinator.
 * The coordinator also transmits broadcast data frames periodically.The devices
 *receive these broadcast data frames
 * and increase a counter.
 * The coordinator also puts the data in the indirect queue periodically and
 *transmits data frames based on the
 * periodic poll request from the device.
 * The results of the proper data transmission/reception are printed to a
 *terminal program via Serial I/O (UART or USB).
 * For demonstration purposes the coordinator's configuration is limited to
 *associate maximum of 100 devices.
 * \note For Two Processor Approach the Application needs to be flashed in the
 *Host board(eg.SAM4L-Xplained Pro) and the Serial-if application(Beacon FFD)
 *(MAC Stack)
 * needs to be flashed in the NCP(Network CoProcessor) board.
 * \section api_modules Application Dependent Modules
 * - \subpage api
 * \section compinfo Compilation Info
 * This software was written for the GNU GCC and IAR .
 * Other compilers may or may not work.
 *
 * \section references References
 * 1)  IEEE Std 802.15.4-2006 Part 15.4: Wireless Medium Access Control (MAC)
 *     and Physical Layer (PHY) Specifications for Low-Rate Wireless Personal
 *Area
 *     Networks (WPANs).\n\n
 * 2)  AVR Wireless Support <A href="http://avr@atmel.com">avr@atmel.com</A>.\n
 *
 * \section contactinfo Contact Information
 * For further information,visit
 * <A href="http://www.atmel.com/avr">www.atmel.com</A>.\n
 */

/* === INCLUDES ============================================================ */
#ifdef MAC_SECURITY_ZIP
#include <string.h>
#include <inttypes.h>
#include <stdio.h>
#include "conf_board.h"
#include "avr2025_mac.h"
#include "delay.h"
#include "common_sw_timer.h"
#include "sio2host.h"
#include "tal.h"
#include "mac_msg_types.h" 
#include <asf.h>
#include "beacon_app.h"
#include "stb_generic.h"
#include "mac_security.h"


/* === MACROS ============================================================== */

/* === GLOBALS ============================================================= */
/** Coordinator IEEE Address */
uint8_t const COORD_IEEE_ADDRESS[] = {0x12, 0x34, 0x56, 0x78, 0x12, 0x34, 0x56, 0x00};
	
/** This array stores all device related information. */
extern associated_device_t device_list[MAX_NUMBER_OF_DEVICES];
/** Stores the number of associated devices. */
extern uint16_t no_of_assoc_devices;


/** Current Channel */
extern uint8_t current_channel;

/** This array stores the current beacon payload. */
extern uint8_t beacon_payload[BEACON_PAYLOAD_LEN];

/** This variable stores the current state of the node. */
extern coord_state_t coord_state;

extern uint8_t current_channel_page;
/*
 * This is implemented as an array of bytes, but actually this is a
 * 128-bit variable. This is the reason why the array needs to be filled
 * in in reverse order than expected.
 */
static const uint8_t default_key[4][16] = {
{
	0xC0, 0xC1, 0xC2, 0xC3, 0xC4, 0xC5, 0xC6, 0xC7,
	0xC8, 0xC9, 0xCA, 0xCB, 0xCC, 0xCD, 0xCE, 0xCF
},	
{
	0xC0, 0xC1, 0xC2, 0xC3, 0xC4, 0xC5, 0xC6, 0xC7,
	0xC8, 0xC9, 0xCA, 0xCB, 0xCC, 0xCD, 0xCE, 0xD0
},
{
	0xC0, 0xC1, 0xC2, 0xC3, 0xC4, 0xC5, 0xC6, 0xC7,
	0xC8, 0xC9, 0xCA, 0xCB, 0xCC, 0xCD, 0xCE, 0xD1
},
{
	0xC0, 0xC1, 0xC2, 0xC3, 0xC4, 0xC5, 0xC6, 0xC7,
	0xC8, 0xC9, 0xCA, 0xCB, 0xCC, 0xCD, 0xCE, 0xCF
}
};

/* Recently associated device number */
extern uint16_t recent_assoc_dev_no;

/* Default key source for MAC Security */
uint8_t default_key_source[8] = {0xFF, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};

/* Parameter to check the which mlme set confirm callback will currently using */
static uint8_t mlme_set_conf_run_time;
/* === PROTOTYPES ========================================================== */

/* Initialize the security PIB and setting the Security PIB for use by mac security */
static void init_secuity_pib(uint8_t PIBAttribute, uint8_t PIBAttributeIndex);

/* mlme set confirm callback will be used after starting the network */ 
static void usr_mlme_set_conf_run_time(uint8_t status, uint8_t PIBAttribute, uint8_t PIBAttributeIndex);
/* === IMPLEMENTATION ====================================================== */


/** @brief Callback function usr_mlme_set_conf
 *
 *  @param status        Result of requested PIB attribute set operation
 *  @param PIBAttribute  Updated PIB attribute
 *  
 */
void usr_mlme_set_conf(uint8_t status, uint8_t PIBAttribute, uint8_t PIBAttributeIndex)
{
    if (status != MAC_SUCCESS)
    {
        /* something went wrong with mlme set request; restart */
        wpan_mlme_reset_req(true);
    }
    else
    {
		if (mlme_set_conf_run_time)
		{
			/* post initialization security pib callback */
			usr_mlme_set_conf_run_time(status, PIBAttribute, PIBAttributeIndex);
		}
		else
		{
			/* Initialize the mac security PIB before starting the network */
			init_secuity_pib(PIBAttribute, PIBAttributeIndex);
		}
    }

    /* Keep compiler happy. */
    PIBAttributeIndex = PIBAttributeIndex;
}




